import org.junit.jupiter.api.Test;

import java.util.*;

/**
 * @author: yd
 * @date: 2022-02-15
 * @version: 1.0
 * @description:
 * @modifiedBy:
 */
public class MyTest {
    @Test
    void test(){
//        List<Integer> list = Arrays.asList(1, 2, 3, 4, 5);
//        HashMap<Integer, Integer> hashMap = new HashMap<>();
//        Set<Integer> sets = Collections.synchronizedSet(new HashSet<>());
//        list.forEach(a ->{
//            hashMap.put(a, a);
//            sets.add(a);
//        });
//        System.out.println(hashMap.toString());
//        System.out.println(sets.toString());方津燕53015750  53009587吕南希
//        List<String> list = Arrays.asList("方镜华53008248", "方灿华53008244", "朱俊53013388", "彭羽53007702", "方青53015684", "丁杨53001481", "张益新53001764", "张琳旋53006068", "万志53005038", "方津燕53015750", "万伟53001784", "丁逸豪53008138", "张瑾53010986", "张秋韵53014947", "方勇53009904", "方津燕53015750", "53009587吕南希", "张红53008937", "丁磊53003362", "彭莹53000140", "彭虎53007459", "53009349高航", "彭珂煜", "丁超53006491", "53009392马健逞", "0502012181", "0502012071", "朱先明53012528", "53009516杨斯逸", "53009587吕南希");
//        List<String> list1 = Arrays.asList("53009516杨斯逸", "方镜华53008248", "万志53005038", "丁磊53003362", "彭羽53007702", "丁超53006491", "53009392马健逞", "0502012181", "丁逸豪53008138", "朱先明53012528", "张瑾53010986", "丁杨53001481", "张秋韵53014947", "方津燕53015750", "万伟53001784", "53009587吕南希", "彭莹53000140", "方勇53009904", "方灿华53008244", "0502012071", "张益新53001764", "张琳旋53006068", "彭珂煜", "彭虎53007459", "53009349高航", "张红53008937", "朱俊53013388", "方青53015684");
//
//        list.forEach( a->{
//            System.out.println(list1.contains(a));
//        });


    }
}
